shubhamdp/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
        // Alert other components of the state change.
        ChipDeviceEvent event;
        event.Type                                 = DeviceEventType::kInternetConnectivityChange;
        event.InternetConnectivityChange.IPv4      = GetConnectivityChange(hadIPv4Conn, haveIPv4Conn);
        event.InternetConnectivityChange.IPv6      = GetConnectivityChange(hadIPv6Conn, haveIPv6Conn);
        event.InternetConnectivityChange.ipAddress = addr;

        PlatformMgr().PostEventOrDie(&event);

        if (haveIPv4Conn != hadIPv4Conn)
        {
            ChipLogProgress(DeviceLayer, "%s Internet connectivity %s", "IPv4", (haveIPv4Conn) ? "ESTABLISHED" : "LOST");
        }

        if (haveIPv6Conn != hadIPv6Conn)
        {
            ChipLogProgress(DeviceLayer, "%s Internet connectivity %s", "IPv6", (haveIPv6Conn) ? "ESTABLISHED" : "LOST");
        }
    }
}

void ConnectivityManagerImpl::OnStationIPv4AddressAvailable(const ip_event_got_ip_t & got_ip)
{
#if CHIP_PROGRESS_LOGGING
    {
        ChipLogProgress(DeviceLayer, "IPv4 address %s on WiFi station interface: " IPSTR "/" IPSTR " gateway " IPSTR,
                        (got_ip.ip_changed) ? "changed" : "ready", IP2STR(&got_ip.ip_info.ip), IP2STR(&got_ip.ip_info.netmask),
                        IP2STR(&got_ip.ip_info.gw));
    }
#endif // CHIP_PROGRESS_LOGGING

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Assigned;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv4AddressLost(void)
{
    ChipLogProgress(DeviceLayer, "IPv4 address lost on WiFi station interface");

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Lost;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv6AddressAvailable(const ip_event_got_ip6_t & got_ip)
{
#if CHIP_PROGRESS_LOGGING
    {
        ChipLogProgress(DeviceLayer, "IPv6 addr available. Ready on %s interface: " IPV6STR, esp_netif_get_ifkey(got_ip.esp_netif),
                        IPV62STR(got_ip.ip6_info.ip));
    }
#endif // CHIP_PROGRESS_LOGGING

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV6_Assigned;
    PlatformMgr().PostEventOrDie(&event);

#ifdef CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER
    uint8_t station_mac[6];
    if (esp_wifi_get_mac(WIFI_IF_STA, station_mac) == ESP_OK)
    {
        static chip::Inet::ESP32EndpointQueueFilter sEndpointQueueFilter;
        char station_mac_str[12];
        for (size_t i = 0; i < 6; ++i)
        {
            uint8_t dig1               = (station_mac[i] & 0xF0) >> 4;
            uint8_t dig2               = station_mac[i] & 0x0F;
            station_mac_str[2 * i]     = static_cast<char>(dig1 > 9 ? ('A' + dig1 - 0xA) : ('0' + dig1));
            station_mac_str[2 * i + 1] = static_cast<char>(dig2 > 9 ? ('A' + dig2 - 0xA) : ('0' + dig2));
        }
        if (sEndpointQueueFilter.SetMdnsHostName(chip::CharSpan(station_mac_str)) == CHIP_NO_ERROR)
        {
            chip::Inet::UDPEndPointImpl::SetQueueFilter(&sEndpointQueueFilter);
        }
        else
        {
            ChipLogError(DeviceLayer, "Failed to set mDNS hostname for endpoint queue filter");
        }
    }
    else
    {
        ChipLogError(DeviceLayer, "Failed to get the MAC address of station netif");
    }
#endif // CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER

#ifdef CONFIG_ENABLE_ROUTE_HOOK
    esp_route_hook_init(esp_netif_get_handle_from_ifkey(ESP32Utils::kDefaultWiFiStationNetifKey));
#endif
}

#if CHIP_CONFIG_ENABLE_ICD_SERVER

CHIP_ERROR ConnectivityManagerImpl::_SetPollingInterval(System::Clock::Milliseconds32 pollingInterval)
{
    (void) pollingInterval;
    // For ESP32 platform, the listen interval of the legacy power-saving mode can only be configured before connecting to AP.
    return CHIP_ERROR_NOT_IMPLEMENTED;
}
#endif // CHIP_CONFIG_ENABLE_ICD_SERVER

#if CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

namespace {
#pragma pack(push, 1)
struct PAFPublishSSI
{
    uint8_t DevOpCode;
    uint16_t DevInfo;
    uint16_t ProductId;
    uint16_t VendorId;
};

CHIP_ERROR ConstructSSI(PAFPublishSSI & ssi)
{
    ssi.DevOpCode = 0x00;
    ReturnErrorOnFailure(GetCommissionableDataProvider()->GetSetupDiscriminator(ssi.DevInfo));
    ReturnErrorOnFailure(GetDeviceInstanceInfoProvider()->GetProductId(ssi.ProductId));
    ReturnErrorOnFailure(GetDeviceInstanceInfoProvider()->GetVendorId(ssi.VendorId));
    return CHIP_NO_ERROR;
} 
} // namespace


CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFPublish(WiFiPAFAdvertiseParam & args)
{
    // Service name
    const char * kServiceName = "_matterc._udp";

    // TODO: args.freq_list and args.freq_list_len should be used to set channel list


    // pre construct the SSI
    PAFPublishSSI ssi;
    ReturnErrorOnFailure(ConstructSSI(ssi));

    wifi_nan_publish_cfg_t nanPublishConfig = {0};

    strlcpy(nanPublishConfig.service_name, kServiceName, sizeof(nanPublishConfig.service_name));
    nanPublishConfig.type = static_cast<wifi_nan_service_type_t>(NAN_PUBLISH_UNSOLICITED | NAN_PUBLISH_SOLICITED);
    nanPublishConfig.srv_proto_type = PROTOCOL_CSA_MATTER;
    memcpy(nanPublishConfig.ssi, &ssi, sizeof(nanPublishConfig.ssi));
    nanPublishConfig.ssi_len = sizeof(ssi);

    uint32_t publish_id = esp_wifi_nan_publish_service(&nanPublishConfig, 0);
    if (publish_id == 0) {
        ChipLogError(DeviceLayer, "Publishing to %s failed", nanPublishConfig.service_name);
        return CHIP_ERROR_INTERNAL;
    }

    ChipLogProgress(DeviceLayer, "Publishing to %s with ID %" PRIu32, nanPublishConfig.service_name, publish_id);
    args.publish_id = publish_id;

