shubhamdp/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
    return CHIP_NO_ERROR;
}

CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFCancelPublish(uint32_t publishId)
{
    esp_err_t err = esp_wifi_nan_cancel_publish(static_cast<uint8_t>(publishId));
    if (err != ESP_OK) {
        ChipLogError(DeviceLayer, "Failed to cancel publish with ID %" PRIu32, publishId);
        return CHIP_ERROR_INTERNAL;
    }
    return CHIP_NO_ERROR;
}

CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFSend(const WiFiPAF::WiFiPAFSession & txInfo, chip::System::PacketBufferHandle && msgBuf)
{
    // TODO: change this to Detail later
    ChipLogProgress(DeviceLayer, "WiFi-PAF: sending PAF Follow-up packets, (%u)", msgBuf->DataLength());
    VerifyOrReturnError(msgBuf.IsNull() == false, CHIP_ERROR_INVALID_ARGUMENT);

    // Ensure outgoing message fits in a single contiguous packet buffer, as currently required by the
    // message fragmentation and reassembly engine.
    if (msgBuf->HasChainedBuffer())
    {
        msgBuf->CompactHead();

        if (msgBuf->HasChainedBuffer())
        {
            ChipLogError(DeviceLayer, "WiFi-PAF: Outbound message too big (%u), skip temporally", msgBuf->DataLength());
            return CHIP_ERROR_OUTBOUND_MESSAGE_TOO_BIG;
        }
    }

    //  Send the packets
    wifi_nan_followup_params_t followupParams = {0};

    // We are downsizing but necessary to avoid warnings, we are sure that txInfo.id and txInfo.peer_id are in range of uint8_t
    followupParams.inst_id = static_cast<uint8_t>(txInfo.id);
    followupParams.peer_inst_id = static_cast<uint8_t>(txInfo.peer_id);
    followupParams.protocol = PROTOCOL_CSA_MATTER;
    followupParams.ssi = msgBuf->Start();
    followupParams.ssi_len = static_cast<uint16_t>(msgBuf->DataLength());
    memcpy(followupParams.peer_mac, mPeerMac, sizeof(followupParams.peer_mac)); // we get peer mac in event handler

    esp_err_t err = esp_wifi_nan_send_message(&followupParams);
    if (err != ESP_OK) {
        ChipLogError(DeviceLayer, "Failed to send followup with ID %u, err: %d", followupParams.inst_id, err);
    }
    else
    {
        ChipLogProgress(DeviceLayer, "WiFi-PAF: sent followup with ID %u", followupParams.inst_id);
    }

    ChipDeviceEvent event{ .Type = DeviceEventType::kCHIPoWiFiPAFWriteDone };
    memcpy(&event.CHIPoWiFiPAFReceived.SessionInfo, &txInfo, sizeof(chip::WiFiPAF::WiFiPAFSession));
    event.CHIPoWiFiPAFReceived.result = err == ESP_OK;
    PlatformMgr().PostEventOrDie(&event);

    return CHIP_NO_ERROR;
}

CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFShutdown(uint32_t id, [[maybe_unused]] WiFiPAF::WiFiPafRole role)
{
    return _WiFiPAFCancelPublish(id);
}

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

} // namespace DeviceLayer
} // namespace chip

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFI
